/******************************************************************************

Copyright (c) 2005 Analog Devices.  All Rights Reserved.

This software is proprietary and confidential.  By using this software you agree
to the terms of the associated Analog Devices License Agreement.
*******************************************************************************

$File: adi_twi.c $
$Revision: 5506 $
$Date: 2011-07-26 10:45:48 -0400 (Tue, 26 Jul 2011) $

Project:    TWI device driver
Title:      TWI definitions


Description:
   This is the primary include file for the TWI driver..

Note:
    define ADI_TWI_PSEUDO or ADI_TWI_PSEUDO_ARBITRATION to allow pseudo TWI
    devices


******************************************************************************/



/******************************************************************************

Include files

******************************************************************************/

#include <services/services.h>      // system service includes
#include <drivers/adi_dev.h>        // device manager includes
#include <drivers/twi/adi_twi.h>
#include <string.h>

/*****************************************************************************/



/******************************************************************************

Macros

******************************************************************************/

// alias for the actual device structure
#define ADI_PDD_DRIVER twi_driver


// number of drivers that have been defined
#define ADI_PDD_DRIVERS (sizeof(Device)/sizeof(Device[0]))


// PDD_CHECK verifies a pointer to a driver (as received from the Device Manager)
// indeed points to one of the driver struct's internal to this file.
#if defined(ADI_DEV_DEBUG)
#define ADI_PDD_CHECK(pdd,rv) {int i=0; while (pdd!=&Device[i++]) if (i>=ADI_PDD_DRIVERS) return rv;}
#else
#define ADI_PDD_CHECK(pdd,rv)
#endif

// uncomment to manually set the hardware TWI ivg
//#define ADI_TWI_IVG 0x0b

#if defined(TWI_CLKDIV) || defined(TWI0_CLKDIV)
#define ADI_TWI_HARDWARE
#else
#define ADI_TWI_PSEUDO
#undef ADI_TWI_HARDWARE
#endif

#if defined(ADI_TWI_PSEUDO_ARBITRATION)
#define ADI_TWI_PSEUDO
#endif

#define ADI_TWI_PSEUDO_PERIOD 128

/*****************************************************************************/



/******************************************************************************

Internal data structures:

Note: This code uses C shifts and masks to access fields within the TWI
    registers. While the processor has opcodes to access bit fields, few of the
    TWI registers actually have multi-bit fields in locations other than the
    bottom bits. Further, this field (in master_ctl) is generally accessed in
    combination with other bits in the same register, leaving little to no
    difference in performance. For all the single-bit fields, the C compiler
    converts masks into one of the processor's bit manipulation opcodes. Using C
    bit fields to access the registers requires (with this compiler) the clutter
    of lots of little struct's each bent with a #pragma, so I chose the shifts
    and masks instead.

******************************************************************************/

typedef union {
    volatile u16 reg;
    u32 alignment;      // the 16 bit reg's are on 32 bit boundaries
} reg32;

typedef struct {        // could also access as an array of reg32
    reg32 clkdiv;       // 1400  [0]
    reg32 control;      // 1404
    reg32 slave_ctl;    // 1408
    reg32 slave_stat;   // 140C
    reg32 slave_addr;   // 1410
    reg32 master_ctl;   // 1414  [5]
    reg32 master_stat;  // 1418
    reg32 master_addr;  // 141C
    reg32 int_stat;     // 1420
    reg32 int_mask;     // 1424
    reg32 fifo_ctl;     // 1428
    reg32 fifo_stat;    // 142C  [11]
    reg32 pad[20];      //       [12-31]
    reg32 xmt_data8;    // 1480  [32]
    reg32 xmt_data16;   // 1484
    reg32 rcv_data8;    // 1488
    reg32 rcv_data16;   // 148C  [36]
    //    TWI's bank has a further [28]
} twi_registers;

// the pseudo TWI port structure, all that is needed to emulate the master twi
#if defined(ADI_TWI_PSEUDO)
typedef struct {
    adi_twi_pseudo_port config;
    twi_registers twi;
    u32 data_byte;
    u8 clock;
    u8 state;
    u16 flags;
    u32 busy_count;     // used to detect whether the bus is busy or not,
                // it is reset when either the scl or sda line changes
    u32 busy_reload;    // set to count to 4.7us is standard mode and 1.3us in fast
    volatile bool run_once; // used by timer handle to make sure not run while running
    u8 unstick;     // used by timer handle to prevent bus lockup
} twi_pseudo_port;
#endif

typedef struct
{
    // these MUST be initialized where the static is defined

    // for hardware twi point to the memory mapped registers
    // otherwise it points to a memory address that is allocated
