/*********************************************************************************

Copyright(c) 2005 Analog Devices, Inc. All Rights Reserved.

This software is proprietary and confidential.  By using this software you agree
to the terms of the associated Analog Devices License Agreement.

$RCSfile: adi_fat.c,v $
$Revision: 3939 $
$Date: 2010-12-10 09:07:11 -0500 (Fri, 10 Dec 2010) $

Description:
            This is the driver source code for FAT Filesystem support.

*********************************************************************************/

/*********************************************************************

Include files

*********************************************************************/

#define __ADI_FAT_C__


#include <services/services.h>          /* system services          */
#include <services/fss/adi_fss.h>       /* File System Service      */
#include <drivers/fsd/fat/adi_fat.h>    /* FAT driver header        */
#include <drivers/fsd/adi_fsd_cache.h>  /* FSD cache header         */


#include <ctype.h>
#include <string.h>
#include <stdio.h>

/*********************************************************************

Enumerations and defines

*********************************************************************/

/* Always build with format capability */
#ifndef ADI_USE_FAT_FORMAT
#define ADI_USE_FAT_FORMAT
#endif

#if 0
#define __ADI_FAT_SECTION_CODE          section("adi_fat_code") static

#define PDD_FAT_PATHNAME_SIZE   260

#define ADI_FAT_ROOT_CLUSTER    0x00000000
#define ADI_FAT_START_OF_FILE   0xFFFFFFFF

#define ADI_FAT_FAT12_MASK      0x00000FFF
#define ADI_FAT_FAT16_MASK      0x0000FFFF
#define ADI_FAT_FAT32_MASK      0x0FFFFFFF

#define ADI_FAT_FIRST_CLUSTER   2

/* Macros to navigate chains of clsuter buffers (Block mode) */

#define GET_NEXT_LBA_BUFFER(P)    ((ADI_FSS_SUPER_BUFFER*)(P)->Buffer.pAdditionalInfo)
#define SET_NEXT_LBA_BUFFER(P,V)  ((P)->Buffer.pAdditionalInfo = (void*)(V));

/*******************************************************************
* Directory entry attribute values
*******************************************************************/

typedef enum
{
    ADI_FAT_SFN,                                // short filename (8.3 format)
    ADI_FAT_LFN,                                // long filename
    ADI_FAT_BAD_FILENAME = 0xFFFF
} ADI_FAT_NAMETYPE;

#define IS_ATTRIBUTE(V,A)       ( ((V)&(A))==A )

/* the following are used to distinguish only between files and sub-directories
 * in opening, closing, removing & renaming files and directories
*/
#define FILE_TYPE_FILE          1
#define FILE_TYPE_SUBDIR        2

/*******************************************************************
* FAT special clustesr values
*******************************************************************/
enum {
    ADI_FAT_FREE_CLUSTER        = 0x00000000,
    ADI_FAT_RESERVED_CLUSTER    = 0x00000001,
    ADI_FAT_BAD_CLUSTER         = 0x0FFFFFF7,
    ADI_FAT_LAST_CLUSTER        = 0x0FFFFFFF
};


/*******************************************************************
* FAT Type values
*******************************************************************/
enum {
    ADI_FAT_TYPE_FAT12,
    ADI_FAT_TYPE_FAT16,
    ADI_FAT_TYPE_FAT32,
    ADI_FAT_TYPE_NONE = 9999,
};


/*******************************************************************
* FAT seek enumeration type values
*******************************************************************/
typedef enum ADI_FAT_SEEK_TYPE {
    ADI_FAT_SEEK_TYPE_CHILD,
    ADI_FAT_SEEK_TYPE_PARENT
} ADI_FAT_SEEK_TYPE;


/*******************************************************************
* FAT Type values
*******************************************************************/
typedef enum ADI_FAT_CLUSTER_TYPE {
    ADI_FAT_CLUSTER_TYPE_ADD,
    ADI_FAT_CLUSTER_TYPE_READ
} ADI_FAT_CLUSTER_TYPE;


/*******************************************************************
* Directory Entry macros
*******************************************************************/
#define IsLastLongEntry(value)  ( (value & 0x40)==0x40 )
#define IsLongDirEntry(value)   ( value==ADI_FAT_DIR_LONG_FILE_NAME )




/*********************************************************************

Data Structures

*********************************************************************/

/*******************************************************************
* Directory entry structure - Short File name entry
*******************************************************************/
typedef struct {
    char    Name[ADI_FAT_SHORT_ENTRY_SIZE];       /* Short file name                                      */
    u8      Attr;           /* Type of entry                                        */
    u8      NTRes;          /* Reserved for NT                                      */
    u8      CrtTimeTenth;   /* Count of tenths of sec of creation time              */
    u16     CrtTime;        /* Creation time                                        */
    u16     CrtDate;        /* Creation Date                                        */
    u16     LastAccDate;    /* Date last accessed                                   */
    u16     FstClusHi;      /* High word of this entry's first cluster no. in FAT   */
    u16     WrtTime;        /* Time last written                                    */
    u16     WrtDate;        /* Date last written                                    */
    u16     FstClusLo;      /* Low word of this entry's first cluster no. in FAT    */
    u32     FileSize;       /* File size in bytes                                   */
} ADI_FAT_DIR_ENTRY;


/*******************************************************************
* Directory entry structure - Long File name entry
*******************************************************************/
typedef struct {
    u8      Ord;            /* This entry's position in long file name list (0x40 terminates list) */
    u8      Name1[10];      /* First part of long name                                             */
    u8      Attr;           /* Attribute, must be ADI_FAT_DIR_LONG_FILE_NAME (0xF)                 */
    u8      Type;           /* If zero - sub-element of long name                                  */
    u8      Chksum;         /* Checksum of short dir entry name                                    */
    u8      Name2[12];      /* Second part of long name                                            */
    u16     FstClusLo;      /* Must be zero                                                        */
    u8      Name3[4];       /* third part of long name                                             */
} ADI_FAT_LFN_ENTRY;


/*******************************************************************
* FAT File Date/Time Macros
*******************************************************************/
#define FAT_YEAR(X)     (((X>>9)&0x007F)+80)
#define FAT_MONTH(X)    (((X>>5)&0x000F)-1)
#define FAT_DAY(X)      (X&0x001F)
#define FAT_HOUR(X)     ((X>>11)&0x001F)
#define FAT_MINUTE(X)   ((X>>5)&0x003F)
#define FAT_SECOND(X)   (X&0x001E)

#define FAT_DATE(X) (               \
    (X.tm_mday&0x001F)|             \
    (((X.tm_mon+1)&0x000F)<<5)|     \
    (((X.tm_year-80)&0x007F)<<9) )

#define FAT_TIME(X) (               \
    (FAT_SECOND(X.tm_sec))|              \
    (((X.tm_min)&0x003F)<<5)|       \
    (((X.tm_hour)&0x001F)<<11) )


/*******************************************************************
* Boot Jump structure
*******************************************************************/
#pragma pack(1)
typedef struct {
    u8 instr;
    u16 addr;
} ADI_FAT_BOOTJUMP;


/*******************************************************************
* Boot Sector/Bios Partition Block structure = FAT12/16
*******************************************************************/
typedef struct {
    // offset       size &  Entity                 Description
    /*   0    */    ADI_FAT_BOOTJUMP    BS_jmpBoot;         // Jump Instruction to boot code; { 0xEB, 0x??, 0x90 } is common
                                                                // alternatively: { 0xE9, 0x??, 0x?? }
    /*   3    */    char    BS_OEMName[8];      // "MSWIN4.1"
    /*   11   */    u16     BPB_BytsPerSec;     // Count of bytes per sector. one of 512,1024,2048 or 4096.
                                                // 512 guarantees maximum compatibility
    /*   13   */    u8      BPB_SecPerClus;     // Number of sectors per allocation unit. 1, 2, 4, 8, 16, 32, 64 or 128
                                                // BPB_BytsPerSec*BPB_SecPerClus <=32K
    /*   14   */    u16     BPB_RsvdSecCnt;     // Number of reserved sectors in the Reserved region of the volume
                                                // FAT12/FAT16 - 1; FAT32 it is typically 32
    /*   16   */    u8      BPB_NumFATs;        // The count of FAT data structures on the volume.
    /*   17   */    u16     BPB_RootEntCnt;     // For FAT12 and FAT16 volumes, this field contains the count of 32-
                                                // byte directory entries in the root directory. For FAT32 volumes,
                                                // this field must be set to 0.
    /*   19   */    u16     BPB_TotSec16;       // the old 16-bit total count of sectors on the volume.
    /*   21   */    u8      BPB_Media;          // Media Type: 0xF8 = fixed, 0xF0 is common for removable media
                                                // legal values: 0xF0, 0xF8, 0xF9, 0xFA, 0xFB, 0xFC, 0xFD, 0xFE, and 0xFF
    /*   22   */    u16     BPB_FATSz16;        // the FAT12/FAT16 16-bit count of sectors occupied by ONE FAT
    /*   24   */    u16     BPB_SecPerTrk;      // Sectors per track geometry value for relevant media visible on interrupt 0x13.
    /*   26   */    u16     BPB_NumHeads;       // Number of heads for interrupt 0x13.
    /*   28   */    u32     BPB_HiddenSec;      // Count of hidden sectors preceding the partition that contains this FAT volume.
    /*   32   */    u32     BPB_TotSec32;       // This field is the new 32-bit total count of sectors on the volume.
} ADI_FAT_BOOT_SECTOR_START;


typedef struct {
    /*   36   */    u32     BPB_FATSz32;        // the FAT32 32-bit count of sectors occupied by ONE FAT. BPB_FATSz16 must be 0.
    /*   40   */    u16     BPB_ExtFlags;       // Defines FAT mirroring
    /*   42   */    u16     BPB_FSVer;          // High byte is major revision number. Low byte is minor revision number. 0:0
    /*   44   */    u32     BPB_RootClus;       // the cluster number of the first cluster of the root directory.
    /*   48   */    u16     BPB_FSInfo;         // Sector number of FSINFO structure in the reserved area of the FAT32 volume
    /*   50   */    u16     BPB_BkBootSec;      // If non-zero, indicates the sector number in the reserved area of the volume
                                                // of a copy of the boot record. Usually 6. No value other than 6 is recommended.
    /*   52   */    u8      BPB_Reserved[12];   // Code that formats FAT volumes should always set all bytes to 0
} ADI_FAT_BOOT_SECTOR_MIDDLE;


typedef struct {
    /*   36   */    u8      BS_DrvNum;          // Int 0x13 drive number.
    /*   37   */    u8      BS_Reserved1;       // Reserved (used by Windows NT).Code that formats FAT volumes should always set this byte to 0.
    /*   38   */    u8      BS_BootSig;         // Extended boot signature (0x29). Indicates that the following three fields in the boot sector are present
    /*   39   */    u32     BS_VolID;           // Volume serial number.
    /*   43    */   char    BS_VolLab[11];      // Volume label
    /*   54    */   char    BS_FilSysType[8];   // One of the strings "FAT12   ", "FAT16   ", or "FAT     ". Informational only
                                                // Always set to "FAT32   " for FAT32
} ADI_FAT_BOOT_SECTOR_END;


typedef struct {
    ADI_FAT_BOOT_SECTOR_START;
    ADI_FAT_BOOT_SECTOR_END;
} ADI_FAT_BOOT_SECTOR_FAT16;


typedef struct {
    ADI_FAT_BOOT_SECTOR_START;
    ADI_FAT_BOOT_SECTOR_MIDDLE;
    ADI_FAT_BOOT_SECTOR_END;
} ADI_FAT_BOOT_SECTOR_FAT32;


typedef struct {
    u32     ExtendedBootSignature;  /* This equals 0x41615252 */
    u8      Reserved1[480];         /* Unused */
    u32     FSInfoSignature;        /* Must equal 0x61417272h */
    u32     FreeClusterCount;       /* The number of unused clusters, -1 if unknown */
    u32     NextFreeCluster;        /* The last allocated cluster */
    u8      Reserved2[12];          /* Unused */
    u32     FSInfoEndSignature;     /* This equals 0xAA550000h */
} ADI_FAT_FSINFO_SECTOR_FAT32;

